In [101]:
import pandas as pd 
from datetime import  datetime , timedelta

- # Load Data

In [102]:
df = pd.read_csv(r"C:\Users\Alaa\Desktop\DataInternEu\linkedin_internships25.csv")
df

,job_id,job_title,company_name,company_location,posted_time
0,4204952998,Business & Data Analyst,Karo Healthcare,"Stockholm, Stockholm County, Sweden",3 weeks ago
1,4205941527,Data Analyst,EpicFrog,"Riga, Riga, Latvia",1 day ago
2,4206694302,Data Scientist,Unilever,"Wageningen, Gelderland, Netherlands",1 day ago
3,4204887150,Data Science Apprentice,Gaming Innovation Group,"San Ġiljan, Saint Julian's, Malta",2 days ago
4,4204705711,Quant / Data Scientist,Venus Labs,Greater Dublin,3 days ago
...,...,...,...,...,...
350,4204747737,2x Data Engineer Interns,Steelcase,"Cluj-Napoca, Cluj, Romania",3 days ago
351,4206805447,"BA Credit Risk & Compliance (100% remote, only...",UST España & Latam,Spain,21 hours ago
352,4206034224,Artificial Intelligence Engineer,Ubique Systems,"Barcelona, Catalonia, Spain",19 hours ago
353,4203322808,Data engineer / Machine Learning engineer,Zirak,Italy,3 days ago
354,4207719536,Chief Technology Officer,Volta Medical,"Marseille, Provence-Alpes-Côte d'Azur, France",1 day ago

# 1. Clean location: Split into city, country (ignore region)

In [ ]:
df['country'] = df['company_location'].str.split(',').str.get(2)
df['city'] = df['company_location'].str.split(',').str[:2].str.join(' ')
df.isna().sum()

job_id               0
job_title            5
company_name         5
company_location     5
posted_time          5
country             76
city                 5
dtype: int64